#include <iostream>
#include <cstdlib>
#include "../include/functions.h"

using namespace std;

void GetStartMenu() {
    cout << " ___________________________________________________\n";
    cout << "|                                                   |\n";
    cout << "|            K N O W L E D G E   B A S E            |\n";
    cout << "|___________________________________________________|\n";
    cout << "|                           |                       |\n";
    cout << "| add {»ндекс источника}    |   добавить источник   |\n";
    cout << "|___________________________|_______________________|\n";
    cout << "|                           |                       |\n";
    cout << "| delete {»ндекс источника} |    удалить источник   |\n";
    cout << "|___________________________|_______________________|\n";
    cout << "|                           |                       |\n";
    cout << "| update {»ндекс источника} | редактровать источник |\n";
    cout << "|___________________________|_______________________|\n";
    cout << "|                           |                       |\n";
    cout << "|           start           | отобразить источники  |\n";
    cout << "|___________________________|_______________________|\n";
    cout << "|                           |                       |\n";
    cout << "|           help            |   отобразить команды  |\n";
    cout << "|___________________________|_______________________|\n";
    cout << "|                           |                       |\n";
    cout << "|           exit            |  завершить программу  |\n";
    cout << "|___________________________|_______________________|\n";
}

void ClearWindow() {
    system("cls");
}